package com.example.techtalker;

import org.springframework.boot.SpringApplication;
import org.springframework.boot.autoconfigure.SpringBootApplication;

@SpringBootApplication
public class TechTalkerApplication {

    public static void main(String[] args) {
        SpringApplication.run(TechTalkerApplication.class, args);
    }

}
//TODO:
// 0-добавить проверку если тема закрыта то писать в ней новые сообщения нельзя + добавить автору возможность
// самостоятельно закрывать открытую им тему
// 1-Добавить в к никнейму Админа его роль
// 2-Добавить цитаты и ответы на сообщения
// 3-Добавить Аватары
// 4-Добавить поддержку загрузки вложений
// 5-Локализовать все остальные шаблоны переписать их на ключи
// 6-Добавить локализацию на Сербский язык
// 7-Сделать вычитку текста носителями языка
// 8-Доработка визуального вида страниц
// 9-Подумать стоит ли добавлять возможность удаления и редактирования сообщений юзеру?
// 10-Добавить смайлы Emoji
// 11-Добавить подтверждение регистрации по почте (Всегда было интересно как это делается под капотом)
// 12-Добавить поиск по темам
// 13-Добавить поиск по сообщениям
// 14-Сделать страницу пользователя где можно редактировать профиль
// 15-Реализовать функционал восстановления забытого пароля/логина по почте
// 16-Как то упаковать в Docker контейнер, задеплоить приложение и разместить его







